## pandas的拼接操作

pandas的拼接分为两组:
    - 级联:pd.concat,pd.append
    - 合并:pd.merge, pd.join

In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

## 0.回顾numpy的级联

In [9]:
n1 = np.arange(0,9).reshape(3,3) # 产生随机的3*3矩阵
n1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [10]:
n2 = np.array([[0,1,2],[4,5,8],[4,6,8]]) # 产生确定的3*3矩阵
n2

array([[0, 1, 2],
       [4, 5, 8],
       [4, 6, 8]])

In [11]:
np.concatenate([n1,n2])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [4, 5, 8],
       [4, 6, 8]])

创建dataframe的函数

In [12]:
def make_df(inds,cols):
    # 字典的key作为列名进行展示
    dic = {
        key:[key+str(i) for i in inds] for key in cols
    }
    df = DataFrame(dic,index = inds)
    return df

In [13]:
make_df([1,2],list('AB'))

    A   B
1  A1  B1
2  A2  B2

In [ ]:
1.使用pd.concat()级联
pandas使用pd.concat函数,与np.concatenate函数类似,只是多了一些参数

## 1) 简单级联

和np.concatenate一样,优先增加行数(默认axis=0)

In [15]:
df1 = make_df([1,2],list('AB'))
df2 = make_df([3,4],list('AB'))

In [16]:
display(df1,df2)

    A   B
1  A1  B1
2  A2  B2

    A   B
3  A3  B3
4  A4  B4

In [17]:
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [21]:
pd.concat((df1,df2),axis = 1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

In [20]:
pd.concat((df1,df2),ignore_index=True)

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [22]:
pd.concat((df1,df2),axis = 1)

     A    B    A    B
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4

可以通过设置axis来改变级联方向

In [23]:
pd.concat([df1,df2],keys=['x','y'])

      A   B
x 1  A1  B1
  2  A2  B2
y 3  A3  B3
  4  A4  B4

## 2) 不匹配级联

不匹配指的是级联的维度的索引不一致。例如纵向级联时列索引不一致,横向级联时行索引不一致

In [24]:
df1 = make_df([1,2,3],list('AB'))
df2 = make_df([3,4],list('BCD'))
display(df1,df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [26]:
pd.concat([df1,df2],ignore_index=True)

     A   B    C    D
0   A1  B1  NaN  NaN
1   A2  B2  NaN  NaN
2   A3  B3  NaN  NaN
3  NaN  B3   C3   D3
4  NaN  B4   C4   D4

In [27]:
pd.concat((df1,df2),join='inner',axis = 1)

    A   B   B   C   D
3  A3  B3  B3  C3  D3

In [30]:
pd.concat((df1,df2),join='outer',axis = 1)

     A    B    B    C    D
1   A1   B1  NaN  NaN  NaN
2   A2   B2  NaN  NaN  NaN
3   A3   B3   B3   C3   D3
4  NaN  NaN   B4   C4   D4

有三种连接方式:
    - 外连接:补NaN(默认模式)取并集
    - 内连接:取交集
    - 连接指定轴join_axes

In [31]:
df2.columns

Index(['B', 'C', 'D'], dtype='object')

In [34]:
pd.concat([df1,df2],join_axes=[df2.columns],ignore_index=True)

    B    C    D
0  B1  NaN  NaN
1  B2  NaN  NaN
2  B3  NaN  NaN
3  B3   C3   D3
4  B4   C4   D4

## 3) 使用append()函数添加

由于在后面级联使用的非常普遍,因此有一个函数append专门用于在后面添加

In [35]:
display(df1,df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

In [36]:
#concat函数属于pandas模块
pd.concat((df1,df2))

     A   B    C    D
1   A1  B1  NaN  NaN
2   A2  B2  NaN  NaN
3   A3  B3  NaN  NaN
3  NaN  B3   C3   D3
4  NaN  B4   C4   D4

In [37]:
#append函数属于DataFrame
df1.append(df2)

     A   B    C    D
1   A1  B1  NaN  NaN
2   A2  B2  NaN  NaN
3   A3  B3  NaN  NaN
3  NaN  B3   C3   D3
4  NaN  B4   C4   D4

## 2. 使用pd.merge()合并

merge需要有交集才能合并,concat不需要  
使用pd.merge()合并时,会自动根据两者相同的column名称的那一列,作为key来进行合并  
注意:每一列的元素不要求一致

In [39]:
df1.merge(df2)

    A   B   C   D
0  A3  B3  C3  D3

In [40]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3

In [41]:
df2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

## 1) 一对以合并

In [45]:
#merge根据相同的元素进行合并的
df1 = DataFrame({
    'name':['张三','李四','小花'],
    'id':[1,2,3],
    'age':[22,25,21]
})

df2 = DataFrame({
    'sex':['男','男','女'],
    'id':[2,3,4],
    'group':['sale','search','service']
})

In [44]:
df1.merge(df2)

   age  id name   group sex
0   25   2   李四    sale   男
1   21   3   小花  search   男

## 2)多对一合并

In [46]:
df1 = DataFrame({
    'name':['张三','李四','小花'],
    'id':[1,2,3],
    'age':[22,25,21]
})

df2 = DataFrame({
    'sex':['男','男','女'],
    'id':[2,3,4],
    'group':['sale','search','service']
})
display(df1,df2)

   age  id name
0   22   1   张三
1   25   2   李四
2   21   3   小花

     group  id sex
0     sale   2   男
1   search   3   男
2  service   4   女

In [47]:
df1.merge(df2)

   age  id name   group sex
0   25   2   李四    sale   男
1   21   3   小花  search   男

## 3)多对多合并

In [48]:
df1 = DataFrame({
    'name':['张三','李四','小花'],
    'salary':[10000,12000,20000],
    'age':[22,25,21]
})

df2 = DataFrame({
    'sex':['男','男','女'],
    'name':['张三','张三','凡凡'],
    'group':['sale','search','service']
})
display(df1,df2)

   age name  salary
0   22   张三   10000
1   25   李四   12000
2   21   小花   20000

     group name sex
0     sale   张三   男
1   search   张三   男
2  service   凡凡   女

In [49]:
df1.merge(df2)

   age name  salary   group sex
0   22   张三   10000    sale   男
1   22   张三   10000  search   男

## 4)key的规范化

- 使用on = 显示指定哪一列为key,当有多个key相同时使用

In [50]:
df1 = DataFrame({'name':['张三','李四','张三'],'salary':[10000,12000,20000],'age':[22,21,25]})

df2 = DataFrame({'age':[21,18,29],'name':['张三','张三','凡凡'],'group':['sale','search','service']})

In [51]:
df1.merge(df2, on='name',suffixes=['_a','_b'])

   age_a name  salary  age_b   group
0     22   张三   10000     21    sale
1     22   张三   10000     18  search
2     25   张三   20000     21    sale
3     25   张三   20000     18  search

- 使用left_on和right_on指定左右两边的列作为key, 当左右两边的key都不相等时使用

In [52]:
df1 = DataFrame({'name':['张三','李四','张三'],'salary':[10000,12000,20000],'age':[22,21,25]})

df2 = DataFrame({'年龄':[21,18,29],'名字':['张三','张三','凡凡'],'group':['sale','search','service']})

In [55]:
df1.merge(df2,left_on='name',right_on='名字')

   age name  salary   group  名字  年龄
0   22   张三   10000    sale  张三  21
1   22   张三   10000  search  张三  18
2   25   张三   20000    sale  张三  21
3   25   张三   20000  search  张三  18

In [56]:
df1 = DataFrame({'name':['张三','李四','张三'],'salary':[10000,12000,20000],'age':[22,21,25]})

df2 = DataFrame({'年龄':[21,18,29],'名字':['张三','张三','凡凡'],'group':['sale','search','service']},
                index = [22,21,25])
display(df1,df2)

   age name  salary
0   22   张三   10000
1   21   李四   12000
2   25   张三   20000

      group  名字  年龄
22     sale  张三  21
21   search  张三  18
25  service  凡凡  29

In [57]:
df1.merge(df2,left_on='age',right_index=True)

   age name  salary    group  名字  年龄
0   22   张三   10000     sale  张三  21
1   21   李四   12000   search  张三  18
2   25   张三   20000  service  凡凡  29

## 5)内合并与外合并
- 内合并:只保留两者都有的key(默认模式)

In [58]:
df1 = DataFrame({'name':['张三','李四','张三'],'salary':[10000,12000,20000],'age':[22,21,25]})

df2 = DataFrame({'age':[21,18,29],'名字':['张三','张三','凡凡'],'group':['sale','search','service']})

In [59]:
display(df1,df2)

   age name  salary
0   22   张三   10000
1   21   李四   12000
2   25   张三   20000

   age    group  名字
0   21     sale  张三
1   18   search  张三
2   29  service  凡凡

In [60]:
# 内合并how= 'inner'
df1.merge(df2,how='inner')

   age name  salary group  名字
0   21   李四   12000  sale  张三

In [61]:
# 外合并 how='outer'
df1.merge(df2,how = 'left')

   age name  salary group   名字
0   22   张三   10000   NaN  NaN
1   21   李四   12000  sale   张三
2   25   张三   20000   NaN  NaN

## 6) 列冲突的解决
- 当列冲突时,即有多个列名称相同时,需要使用on=来指定哪一个列作为key,配合suffixes指定冲突列名
- 可以使用suffixes = 自己指定的后缀

In [63]:
#期中
df1 = DataFrame({'name':['张三','李四','张三'],'degree':[120,118,149],'age':[22,21,25]})

#期末考试
df2 = DataFrame({'degree':[99,97,129],'name':['张三','张三','凡凡'],'group':['sale','search','service']})

In [64]:
display(df1,df2)

   age  degree name
0   22     120   张三
1   21     118   李四
2   25     149   张三

   degree    group name
0      99     sale   张三
1      97   search   张三
2     129  service   凡凡

In [65]:
df1.merge(df2,on='name',suffixes=['_期中','_期末'])

   age  degree_期中 name  degree_期末   group
0   22        120   张三         99    sale
1   22        120   张三         97  search
2   25        149   张三         99    sale
3   25        149   张三         97  search